src/randomMatrix/templateCases/cavity/cavity_base-pce/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16
(
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
6.25e-06
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 4(0.00025 0.00025 0.00025 0.00025);
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
0.00025
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
