src/randomMatrix/templateCases/cavity/cavity_base-pce/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   nonuniform List<scalar> 
16
(
0.000522886
0.000807777
0.00104248
0.00124686
0.000478233
0.000632377
0.00120513
0.00249722
0.000305505
0.000521075
0.000540747
0.00376317
0.00177395
0.00467555
0.00624489
0.00586014
)
;

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 4(0.00177395 0.00467555 0.00624489 0.00586014);
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
12
(
0.000522886
0.000478233
0.000305505
0.00177395
0.00124686
0.00249722
0.00376317
0.00586014
0.000522886
0.000807777
0.00104248
0.00124686
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
